686my686/MSPM0G3507-AutoCar/msp_test/MSPM0G_CAR_K230/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define GPIO_HFXT_PORT                                                     GPIOA
#define GPIO_HFXIN_PIN                                             DL_GPIO_PIN_5
#define GPIO_HFXIN_IOMUX                                         (IOMUX_PINCM10)
#define GPIO_HFXOUT_PIN                                            DL_GPIO_PIN_6
#define GPIO_HFXOUT_IOMUX                                        (IOMUX_PINCM11)
#define CPUCLK_FREQ                                                     80000000



/* Defines for motor_PWM */
#define motor_PWM_INST                                                     TIMA0
#define motor_PWM_INST_IRQHandler                               TIMA0_IRQHandler
#define motor_PWM_INST_INT_IRQN                                 (TIMA0_INT_IRQn)
#define motor_PWM_INST_CLK_FREQ                                         40000000
/* GPIO defines for channel 0 */
#define GPIO_motor_PWM_C0_PORT                                             GPIOB
#define GPIO_motor_PWM_C0_PIN                                      DL_GPIO_PIN_8
#define GPIO_motor_PWM_C0_IOMUX                                  (IOMUX_PINCM25)
#define GPIO_motor_PWM_C0_IOMUX_FUNC                 IOMUX_PINCM25_PF_TIMA0_CCP0
#define GPIO_motor_PWM_C0_IDX                                DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_motor_PWM_C1_PORT                                             GPIOB
#define GPIO_motor_PWM_C1_PIN                                     DL_GPIO_PIN_12
#define GPIO_motor_PWM_C1_IOMUX                                  (IOMUX_PINCM29)
#define GPIO_motor_PWM_C1_IOMUX_FUNC                 IOMUX_PINCM29_PF_TIMA0_CCP1
#define GPIO_motor_PWM_C1_IDX                                DL_TIMER_CC_1_INDEX
/* GPIO defines for channel 2 */
#define GPIO_motor_PWM_C2_PORT                                             GPIOA
#define GPIO_motor_PWM_C2_PIN                                      DL_GPIO_PIN_3
#define GPIO_motor_PWM_C2_IOMUX                                   (IOMUX_PINCM8)
#define GPIO_motor_PWM_C2_IOMUX_FUNC                  IOMUX_PINCM8_PF_TIMA0_CCP2
#define GPIO_motor_PWM_C2_IDX                                DL_TIMER_CC_2_INDEX
/* GPIO defines for channel 3 */
#define GPIO_motor_PWM_C3_PORT                                             GPIOB
#define GPIO_motor_PWM_C3_PIN                                      DL_GPIO_PIN_2
#define GPIO_motor_PWM_C3_IOMUX                                  (IOMUX_PINCM15)
#define GPIO_motor_PWM_C3_IOMUX_FUNC                 IOMUX_PINCM15_PF_TIMA0_CCP3
#define GPIO_motor_PWM_C3_IDX                                DL_TIMER_CC_3_INDEX

/* Defines for PWM_Servo */
#define PWM_Servo_INST                                                     TIMG7
#define PWM_Servo_INST_IRQHandler                               TIMG7_IRQHandler
#define PWM_Servo_INST_INT_IRQN                                 (TIMG7_INT_IRQn)
#define PWM_Servo_INST_CLK_FREQ                                           200000
/* GPIO defines for channel 0 */
#define GPIO_PWM_Servo_C0_PORT                                             GPIOA
#define GPIO_PWM_Servo_C0_PIN                                     DL_GPIO_PIN_28
#define GPIO_PWM_Servo_C0_IOMUX                                   (IOMUX_PINCM3)
#define GPIO_PWM_Servo_C0_IOMUX_FUNC                  IOMUX_PINCM3_PF_TIMG7_CCP0
#define GPIO_PWM_Servo_C0_IDX                                DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_Servo_C1_PORT                                             GPIOA
#define GPIO_PWM_Servo_C1_PIN                                      DL_GPIO_PIN_7
#define GPIO_PWM_Servo_C1_IOMUX                                  (IOMUX_PINCM14)
#define GPIO_PWM_Servo_C1_IOMUX_FUNC                 IOMUX_PINCM14_PF_TIMG7_CCP1
#define GPIO_PWM_Servo_C1_IDX                                DL_TIMER_CC_1_INDEX



/* Defines for TIMER_20ms */
#define TIMER_20ms_INST                                                  (TIMG0)
#define TIMER_20ms_INST_IRQHandler                              TIMG0_IRQHandler
#define TIMER_20ms_INST_INT_IRQN                                (TIMG0_INT_IRQn)
#define TIMER_20ms_INST_LOAD_VALUE                                       (9999U)
/* Defines for TIMER_1ms */
#define TIMER_1ms_INST                                                   (TIMA1)
#define TIMER_1ms_INST_IRQHandler                               TIMA1_IRQHandler
#define TIMER_1ms_INST_INT_IRQN                                 (TIMA1_INT_IRQn)
#define TIMER_1ms_INST_LOAD_VALUE                                         (799U)



/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_FREQUENCY                                            4000000
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_11
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_10
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM22)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM21)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM21_PF_UART0_TX
#define UART_0_BAUD_RATE                                                (115200)
#define UART_0_IBRD_4_MHZ_115200_BAUD                                        (2)
#define UART_0_FBRD_4_MHZ_115200_BAUD                                       (11)
/* Defines for UART_1 */
#define UART_1_INST                                                        UART1
#define UART_1_INST_FREQUENCY                                            8000000
#define UART_1_INST_IRQHandler                                  UART1_IRQHandler
#define UART_1_INST_INT_IRQN                                      UART1_INT_IRQn
#define GPIO_UART_1_RX_PORT                                                GPIOA
#define GPIO_UART_1_TX_PORT                                                GPIOB
#define GPIO_UART_1_RX_PIN                                         DL_GPIO_PIN_9
#define GPIO_UART_1_TX_PIN                                         DL_GPIO_PIN_4
#define GPIO_UART_1_IOMUX_RX                                     (IOMUX_PINCM20)
#define GPIO_UART_1_IOMUX_TX                                     (IOMUX_PINCM17)
#define GPIO_UART_1_IOMUX_RX_FUNC                      IOMUX_PINCM20_PF_UART1_RX
#define GPIO_UART_1_IOMUX_TX_FUNC                      IOMUX_PINCM17_PF_UART1_TX
#define UART_1_BAUD_RATE                                                  (9600)
#define UART_1_IBRD_8_MHZ_9600_BAUD                                         (52)
#define UART_1_FBRD_8_MHZ_9600_BAUD                                          (5)
/* Defines for UART_2 */
#define UART_2_INST                                                        UART2
#define UART_2_INST_FREQUENCY                                            4000000
#define UART_2_INST_IRQHandler                                  UART2_IRQHandler
#define UART_2_INST_INT_IRQN                                      UART2_INT_IRQn
#define GPIO_UART_2_RX_PORT                                                GPIOB
#define GPIO_UART_2_TX_PORT                                                GPIOA
#define GPIO_UART_2_RX_PIN                                        DL_GPIO_PIN_18
#define GPIO_UART_2_TX_PIN                                        DL_GPIO_PIN_23
#define GPIO_UART_2_IOMUX_RX                                     (IOMUX_PINCM44)
#define GPIO_UART_2_IOMUX_TX                                     (IOMUX_PINCM53)
#define GPIO_UART_2_IOMUX_RX_FUNC                      IOMUX_PINCM44_PF_UART2_RX
#define GPIO_UART_2_IOMUX_TX_FUNC                      IOMUX_PINCM53_PF_UART2_TX
#define UART_2_BAUD_RATE                                                (115200)
#define UART_2_IBRD_4_MHZ_115200_BAUD                                        (2)
#define UART_2_FBRD_4_MHZ_115200_BAUD                                       (11)
/* Defines for UART_3 */
#define UART_3_INST                                                        UART3
#define UART_3_INST_FREQUENCY                                           20000000
#define UART_3_INST_IRQHandler                                  UART3_IRQHandler
#define UART_3_INST_INT_IRQN                                      UART3_INT_IRQn
#define GPIO_UART_3_RX_PORT                                                GPIOA
#define GPIO_UART_3_TX_PORT                                                GPIOA
#define GPIO_UART_3_RX_PIN                                        DL_GPIO_PIN_13
#define GPIO_UART_3_TX_PIN                                        DL_GPIO_PIN_26
#define GPIO_UART_3_IOMUX_RX                                     (IOMUX_PINCM35)
#define GPIO_UART_3_IOMUX_TX                                     (IOMUX_PINCM59)
#define GPIO_UART_3_IOMUX_RX_FUNC                      IOMUX_PINCM35_PF_UART3_RX
#define GPIO_UART_3_IOMUX_TX_FUNC                      IOMUX_PINCM59_PF_UART3_TX
#define UART_3_BAUD_RATE                                                (115200)
#define UART_3_IBRD_20_MHZ_115200_BAUD                                      (10)
#define UART_3_FBRD_20_MHZ_115200_BAUD                                      (54)




/* Defines for SPI_W25Q64 */
#define SPI_W25Q64_INST                                                    SPI1
#define SPI_W25Q64_INST_IRQHandler                              SPI1_IRQHandler
#define SPI_W25Q64_INST_INT_IRQN                                  SPI1_INT_IRQn
#define GPIO_SPI_W25Q64_PICO_PORT                                         GPIOB
#define GPIO_SPI_W25Q64_PICO_PIN                                 DL_GPIO_PIN_15
#define GPIO_SPI_W25Q64_IOMUX_PICO                              (IOMUX_PINCM32)
#define GPIO_SPI_W25Q64_IOMUX_PICO_FUNC              IOMUX_PINCM32_PF_SPI1_PICO
#define GPIO_SPI_W25Q64_POCI_PORT                                         GPIOB
#define GPIO_SPI_W25Q64_POCI_PIN                                 DL_GPIO_PIN_14
#define GPIO_SPI_W25Q64_IOMUX_POCI                              (IOMUX_PINCM31)
#define GPIO_SPI_W25Q64_IOMUX_POCI_FUNC              IOMUX_PINCM31_PF_SPI1_POCI
/* GPIO configuration for SPI_W25Q64 */
#define GPIO_SPI_W25Q64_SCLK_PORT                                         GPIOB
#define GPIO_SPI_W25Q64_SCLK_PIN                                 DL_GPIO_PIN_16
#define GPIO_SPI_W25Q64_IOMUX_SCLK                              (IOMUX_PINCM33)
#define GPIO_SPI_W25Q64_IOMUX_SCLK_FUNC              IOMUX_PINCM33_PF_SPI1_SCLK



/* Defines for ADC_Senor */
#define ADC_Senor_INST                                                      ADC0
#define ADC_Senor_INST_IRQHandler                                ADC0_IRQHandler
#define ADC_Senor_INST_INT_IRQN                                  (ADC0_INT_IRQn)
#define ADC_Senor_ADCMEM_IR_left                              DL_ADC12_MEM_IDX_0
#define ADC_Senor_ADCMEM_IR_left_REF             DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_Senor_ADCMEM_IR_left_REF_VOLTAGE_V                                     3.3
#define ADC_Senor_ADCMEM_IR_right                             DL_ADC12_MEM_IDX_1
#define ADC_Senor_ADCMEM_IR_right_REF            DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_Senor_ADCMEM_IR_right_REF_VOLTAGE_V                                     3.3
#define ADC_Senor_ADCMEM_light_left                           DL_ADC12_MEM_IDX_2
#define ADC_Senor_ADCMEM_light_left_REF          DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_Senor_ADCMEM_light_left_REF_VOLTAGE_V                                     3.3
#define ADC_Senor_ADCMEM_light_right                          DL_ADC12_MEM_IDX_3
#define ADC_Senor_ADCMEM_light_right_REF         DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_Senor_ADCMEM_light_right_REF_VOLTAGE_V                                     3.3
#define ADC_Senor_ADCMEM_4                                    DL_ADC12_MEM_IDX_4
#define ADC_Senor_ADCMEM_4_REF                   DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC_Senor_ADCMEM_4_REF_VOLTAGE_V                                     3.3
#define GPIO_ADC_Senor_C2_PORT                                             GPIOA
#define GPIO_ADC_Senor_C2_PIN                                     DL_GPIO_PIN_25
#define GPIO_ADC_Senor_C4_PORT                                             GPIOB
#define GPIO_ADC_Senor_C4_PIN                                     DL_GPIO_PIN_25
#define GPIO_ADC_Senor_C5_PORT                                             GPIOB
#define GPIO_ADC_Senor_C5_PIN                                     DL_GPIO_PIN_24
#define GPIO_ADC_Senor_C3_PORT                                             GPIOA
#define GPIO_ADC_Senor_C3_PIN                                     DL_GPIO_PIN_24
#define GPIO_ADC_Senor_C0_PORT                                             GPIOA
#define GPIO_ADC_Senor_C0_PIN                                     DL_GPIO_PIN_27



/* Port definition for Pin Group LED */
#define LED_PORT                                                         (GPIOA)

/* Defines for MCU: GPIOA.17 with pinCMx 39 on package pin 10 */
#define LED_MCU_PIN                                             (DL_GPIO_PIN_17)
#define LED_MCU_IOMUX                                            (IOMUX_PINCM39)
/* Port definition for Pin Group BEEP */
#define BEEP_PORT                                                        (GPIOB)

/* Defines for Buzzer: GPIOB.5 with pinCMx 18 on package pin 53 */
#define BEEP_Buzzer_PIN                                          (DL_GPIO_PIN_5)
#define BEEP_Buzzer_IOMUX                                        (IOMUX_PINCM18)
/* Port definition for Pin Group RGB */
#define RGB_PORT                                                         (GPIOB)

/* Defines for WQ2812: GPIOB.10 with pinCMx 27 on package pin 62 */
#define RGB_WQ2812_PIN                                          (DL_GPIO_PIN_10)
#define RGB_WQ2812_IOMUX                                         (IOMUX_PINCM27)
/* Port definition for Pin Group Infrared_borad */
#define Infrared_borad_PORT                                              (GPIOB)

