686my686/MSPM0G3507-AutoCar/msp_test/MSPM0G_CAR_K230/ti_msp_dl_config.h
/* Defines for IR_switch: GPIOB.9 with pinCMx 26 on package pin 61 */
#define Infrared_borad_IR_switch_PIN                             (DL_GPIO_PIN_9)
#define Infrared_borad_IR_switch_IOMUX                           (IOMUX_PINCM26)
/* Port definition for Pin Group IRContorl */
#define IRContorl_PORT                                                   (GPIOB)

/* Defines for GET_OUT: GPIOB.3 with pinCMx 16 on package pin 51 */
// groups represented: ["GPIO_ENCODER_L","GPIO_ENCODER_R","IRContorl"]
// pins affected: ["H1A","H1B","H2A","GET_OUT"]
#define GPIO_MULTIPLE_GPIOB_INT_IRQN                            (GPIOB_INT_IRQn)
#define GPIO_MULTIPLE_GPIOB_INT_IIDX            (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define IRContorl_GET_OUT_IIDX                               (DL_GPIO_IIDX_DIO3)
#define IRContorl_GET_OUT_PIN                                    (DL_GPIO_PIN_3)
#define IRContorl_GET_OUT_IOMUX                                  (IOMUX_PINCM16)
/* Port definition for Pin Group SPI */
#define SPI_PORT                                                         (GPIOB)

/* Defines for CS: GPIOB.6 with pinCMx 23 on package pin 58 */
#define SPI_CS_PIN                                               (DL_GPIO_PIN_6)
#define SPI_CS_IOMUX                                             (IOMUX_PINCM23)
/* Defines for button1: GPIOA.18 with pinCMx 40 on package pin 11 */
#define KEY_button1_PORT                                                 (GPIOA)
#define KEY_button1_PIN                                         (DL_GPIO_PIN_18)
#define KEY_button1_IOMUX                                        (IOMUX_PINCM40)
/* Defines for button2: GPIOB.23 with pinCMx 51 on package pin 22 */
#define KEY_button2_PORT                                                 (GPIOB)
#define KEY_button2_PIN                                         (DL_GPIO_PIN_23)
#define KEY_button2_IOMUX                                        (IOMUX_PINCM51)
/* Defines for button3: GPIOB.20 with pinCMx 48 on package pin 19 */
#define KEY_button3_PORT                                                 (GPIOB)
#define KEY_button3_PIN                                         (DL_GPIO_PIN_20)
#define KEY_button3_IOMUX                                        (IOMUX_PINCM48)
/* Port definition for Pin Group GPIO_ENCODER_L */
#define GPIO_ENCODER_L_PORT                                              (GPIOB)

/* Defines for H1A: GPIOB.21 with pinCMx 49 on package pin 20 */
#define GPIO_ENCODER_L_H1A_IIDX                             (DL_GPIO_IIDX_DIO21)
#define GPIO_ENCODER_L_H1A_PIN                                  (DL_GPIO_PIN_21)
#define GPIO_ENCODER_L_H1A_IOMUX                                 (IOMUX_PINCM49)
/* Defines for H1B: GPIOB.22 with pinCMx 50 on package pin 21 */
#define GPIO_ENCODER_L_H1B_IIDX                             (DL_GPIO_IIDX_DIO22)
#define GPIO_ENCODER_L_H1B_PIN                                  (DL_GPIO_PIN_22)
#define GPIO_ENCODER_L_H1B_IOMUX                                 (IOMUX_PINCM50)
/* Defines for H2A: GPIOB.13 with pinCMx 30 on package pin 1 */
#define GPIO_ENCODER_R_H2A_PORT                                          (GPIOB)
#define GPIO_ENCODER_R_H2A_IIDX                             (DL_GPIO_IIDX_DIO13)
#define GPIO_ENCODER_R_H2A_PIN                                  (DL_GPIO_PIN_13)
#define GPIO_ENCODER_R_H2A_IOMUX                                 (IOMUX_PINCM30)
/* Defines for H2B: GPIOA.31 with pinCMx 6 on package pin 39 */
#define GPIO_ENCODER_R_H2B_PORT                                          (GPIOA)
// pins affected by this interrupt request:["H2B"]
#define GPIO_ENCODER_R_GPIOA_INT_IRQN                           (GPIOA_INT_IRQn)
#define GPIO_ENCODER_R_GPIOA_INT_IIDX           (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define GPIO_ENCODER_R_H2B_IIDX                             (DL_GPIO_IIDX_DIO31)
#define GPIO_ENCODER_R_H2B_PIN                                  (DL_GPIO_PIN_31)
#define GPIO_ENCODER_R_H2B_IOMUX                                  (IOMUX_PINCM6)
/* Port definition for Pin Group OLED */
#define OLED_PORT                                                        (GPIOA)

/* Defines for SCL1: GPIOA.15 with pinCMx 37 on package pin 8 */
#define OLED_SCL1_PIN                                           (DL_GPIO_PIN_15)
#define OLED_SCL1_IOMUX                                          (IOMUX_PINCM37)
/* Defines for SDA1: GPIOA.30 with pinCMx 5 on package pin 37 */
#define OLED_SDA1_PIN                                           (DL_GPIO_PIN_30)
#define OLED_SDA1_IOMUX                                           (IOMUX_PINCM5)
/* Port definition for Pin Group SR04 */
#define SR04_PORT                                                        (GPIOB)

/* Defines for TRIG: GPIOB.7 with pinCMx 24 on package pin 59 */
#define SR04_TRIG_PIN                                            (DL_GPIO_PIN_7)
#define SR04_TRIG_IOMUX                                          (IOMUX_PINCM24)
/* Defines for ECHO: GPIOB.11 with pinCMx 28 on package pin 63 */
#define SR04_ECHO_PIN                                           (DL_GPIO_PIN_11)
#define SR04_ECHO_IOMUX                                          (IOMUX_PINCM28)
/* Port definition for Pin Group IR_Track */
#define IR_Track_PORT                                                    (GPIOB)

/* Defines for X1: GPIOB.26 with pinCMx 57 on package pin 28 */
#define IR_Track_X1_PIN                                         (DL_GPIO_PIN_26)
#define IR_Track_X1_IOMUX                                        (IOMUX_PINCM57)
/* Defines for X2: GPIOB.27 with pinCMx 58 on package pin 29 */
#define IR_Track_X2_PIN                                         (DL_GPIO_PIN_27)
#define IR_Track_X2_IOMUX                                        (IOMUX_PINCM58)
/* Defines for X3: GPIOB.0 with pinCMx 12 on package pin 47 */
#define IR_Track_X3_PIN                                          (DL_GPIO_PIN_0)
#define IR_Track_X3_IOMUX                                        (IOMUX_PINCM12)
/* Defines for X4: GPIOB.1 with pinCMx 13 on package pin 48 */
#define IR_Track_X4_PIN                                          (DL_GPIO_PIN_1)
#define IR_Track_X4_IOMUX                                        (IOMUX_PINCM13)
/* Port definition for Pin Group MPU6050 */
#define MPU6050_PORT                                                     (GPIOA)

/* Defines for SDA: GPIOA.0 with pinCMx 1 on package pin 33 */
#define MPU6050_SDA_PIN                                          (DL_GPIO_PIN_0)
#define MPU6050_SDA_IOMUX                                         (IOMUX_PINCM1)
/* Defines for SCL: GPIOA.1 with pinCMx 2 on package pin 34 */
#define MPU6050_SCL_PIN                                          (DL_GPIO_PIN_1)
#define MPU6050_SCL_IOMUX                                         (IOMUX_PINCM2)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_SYSCTL_CLK_init(void);
void SYSCFG_DL_motor_PWM_init(void);
void SYSCFG_DL_PWM_Servo_init(void);
void SYSCFG_DL_TIMER_20ms_init(void);
void SYSCFG_DL_TIMER_1ms_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_UART_2_init(void);
void SYSCFG_DL_UART_3_init(void);
void SYSCFG_DL_SPI_W25Q64_init(void);
void SYSCFG_DL_ADC_Senor_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
